---
kind: method
id: M:Autodesk.Revit.DB.View.GetWorksharingDisplayMode
zh: 视图
source: html/ea5269b8-64f9-5f49-0f88-717f027416f3.htm
---
# Autodesk.Revit.DB.View.GetWorksharingDisplayMode Method

**中文**: 视图

Gets the current worksharing display mode for this view.

## Syntax (C#)
```csharp
public WorksharingDisplayMode GetWorksharingDisplayMode()
```

## Returns
The active worksharing display mode in this view.

## Remarks
Returns "Off" if no worksharing display mode is currently enabled.